In [32]:
i="""ID_1  Name_1   ID_2   Name_2
1      Bob      NaN    NaN"""

In [37]:
import utils
import numpy as np
import pandas

In [34]:
df=utils.SOF_to_df(i)

In [35]:
df

  ID_1 Name_1 ID_2 Name_2
1    1    Bob  NaN    NaN

In [38]:
df.replace("NaN",np.NaN)

  ID_1 Name_1  ID_2  Name_2
1    1    Bob   NaN     NaN

In [41]:
df.fillna(2)

  ID_1 Name_1 ID_2 Name_2
1    1    Bob  NaN    NaN

In [24]:
df.Name_2 = df.Name_2.where(df.Name_2 == "NaN")

In [31]:
df.Name_2.mask(df.Name_2 == "NaN", df.Name_1)

1    Bob
Name: Name_2, dtype: object